sample/k8s/multibench-oneparams/k8s-hr-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-t4-c512-d30-R2000
No argument supplied nginx
using  args: threads=4 and connections=512 and duration=30 and requests=2000
Running 30s test @ http://localhost:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 2.799ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.796ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.802ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 2.822ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     2.81ms    1.19ms   6.78ms   74.75%
    Req/Sec   525.90    237.09     1.11k    69.34%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.46ms
 75.000%    3.36ms
 90.000%    4.45ms
 99.000%    6.78ms
 99.900%    8.46ms
 99.990%   10.06ms
 99.999%   10.42ms
100.000%   10.42ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.990     0.000000            1         1.00
       1.610     0.100000         3984         1.11
       1.912     0.200000         7948         1.25
       2.067     0.300000        11957         1.43
       2.221     0.400000        15919         1.67
       2.457     0.500000        19871         2.00
       2.581     0.550000        21844         2.22
       2.727     0.600000        23837         2.50
       2.941     0.650000        25805         2.86
       3.123     0.700000        27784         3.33
       3.363     0.750000        29777         4.00
       3.503     0.775000        30777         4.44
       3.631     0.800000        31762         5.00
       3.777     0.825000        32746         5.71
       3.981     0.850000        33737         6.67
       4.183     0.875000        34730         8.00
       4.311     0.887500        35237         8.89
       4.455     0.900000        35732        10.00
       4.603     0.912500        36221        11.43
       4.771     0.925000        36720        13.33
       4.987     0.937500        37219        16.00
       5.099     0.943750        37460        17.78
       5.231     0.950000        37706        20.00
       5.383     0.956250        37959        22.86
       5.547     0.962500        38202        26.67
       5.743     0.968750        38451        32.00
       5.843     0.971875        38576        35.56
       5.955     0.975000        38699        40.00
       6.079     0.978125        38825        45.71
       6.207     0.981250        38946        53.33
       6.363     0.984375        39070        64.00
       6.471     0.985938        39133        71.11
       6.575     0.987500        39196        80.00
       6.703     0.989062        39257        91.43
       6.847     0.990625        39318       106.67
       6.995     0.992188        39381       128.00
       7.087     0.992969        39411       142.22
       7.163     0.993750        39442       160.00
       7.259     0.994531        39473       182.86
       7.359     0.995313        39504       213.33
       7.483     0.996094        39536       256.00
       7.583     0.996484        39552       284.44
       7.679     0.996875        39566       320.00
       7.755     0.997266        39582       365.71
       7.895     0.997656        39597       426.67
       7.999     0.998047        39613       512.00
       8.119     0.998242        39621       568.89
       8.155     0.998437        39629       640.00
       8.263     0.998633        39636       731.43
       8.407     0.998828        39645       853.33
       8.487     0.999023        39653      1024.00
       8.575     0.999121        39656      1137.78
       8.655     0.999219        39659      1280.00
       8.767     0.999316        39663      1462.86
       8.951     0.999414        39667      1706.67
       9.047     0.999512        39671      2048.00
       9.063     0.999561        39673      2275.56
       9.319     0.999609        39675      2560.00
       9.447     0.999658        39677      2925.71
       9.471     0.999707        39679      3413.33
       9.615     0.999756        39681      4096.00
       9.647     0.999780        39682      4551.11
       9.735     0.999805        39683      5120.00
       9.839     0.999829        39684      5851.43
       9.911     0.999854        39685      6826.67
      10.055     0.999878        39686      8192.00
      10.055     0.999890        39686      9102.22
      10.215     0.999902        39687     10240.00
      10.215     0.999915        39687     11702.86
      10.223     0.999927        39688     13653.33
      10.223     0.999939        39688     16384.00
      10.223     0.999945        39688     18204.44
      10.351     0.999951        39689     20480.00
      10.351     0.999957        39689     23405.71
      10.351     0.999963        39689     27306.67
      10.351     0.999969        39689     32768.00
      10.351     0.999973        39689     36408.89
      10.423     0.999976        39690     40960.00
      10.423     1.000000        39690          inf
#[Mean    =        2.809, StdDeviation   =        1.188]
#[Max     =       10.416, Total count    =        39690]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  59189 requests in 30.00s, 24.48MB read
  Socket errors: connect 0, read 0, write 0, timeout 8
Requests/sec:   1972.92
Transfer/sec:    835.56KB