sample/k8s/multibench-oneparams/k8s-hr-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-t4-c512-d30-R4000
No argument supplied nginx
using  args: threads=4 and connections=512 and duration=30 and requests=4000
Running 30s test @ http://localhost:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 2920.002ms, rate sampling interval: 10944ms
  Thread calibration: mean lat.: 2873.038ms, rate sampling interval: 10854ms
  Thread calibration: mean lat.: 2965.444ms, rate sampling interval: 11042ms
  Thread calibration: mean lat.: 2953.661ms, rate sampling interval: 10321ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency    12.19s     3.64s   19.37s    60.54%
    Req/Sec   388.25      1.48   390.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%   12.17s 
 75.000%   15.16s 
 90.000%   17.12s 
 99.000%   19.37s 
 99.900%   20.53s 
 99.990%   21.66s 
 99.999%   21.76s 
100.000%   21.76s 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    4128.767     0.000000            1         1.00
    7270.399     0.100000         3125         1.11
    8577.023     0.200000         6247         1.25
    9805.823     0.300000         9380         1.43
   10969.087     0.400000        12483         1.67
   12165.119     0.500000        15630         2.00
   12746.751     0.550000        17178         2.22
   13344.767     0.600000        18743         2.50
   13959.167     0.650000        20284         2.86
   14540.799     0.700000        21846         3.33
   15163.391     0.750000        23425         4.00
   15474.687     0.775000        24186         4.44
   15777.791     0.800000        24968         5.00
   16089.087     0.825000        25758         5.71
   16424.959     0.850000        26544         6.67
   16760.831     0.875000        27308         8.00
   16941.055     0.887500        27698         8.89
   17121.279     0.900000        28093        10.00
   17317.887     0.912500        28478        11.43
   17530.879     0.925000        28880        13.33
   17743.871     0.937500        29268        16.00
   17842.175     0.943750        29457        17.78
   17973.247     0.950000        29654        20.00
   18120.703     0.956250        29845        22.86
   18268.159     0.962500        30039        26.67
   18431.999     0.968750        30231        32.00
   18530.303     0.971875        30328        35.56
   18644.991     0.975000        30432        40.00
   18743.295     0.978125        30528        45.71
   18890.751     0.981250        30623        53.33
   19038.207     0.984375        30726        64.00
   19120.127     0.985938        30774        71.11
   19202.047     0.987500        30821        80.00
   19300.351     0.989062        30869        91.43
   19431.423     0.990625        30920       106.67
   19546.111     0.992188        30966       128.00
   19595.263     0.992969        30986       142.22
   19677.183     0.993750        31010       160.00
   19791.871     0.994531        31040       182.86
   19906.559     0.995313        31062       213.33
   19988.479     0.996094        31084       256.00
   20037.631     0.996484        31098       284.44
   20086.783     0.996875        31109       320.00
   20135.935     0.997266        31122       365.71
   20201.471     0.997656        31133       426.67
   20283.391     0.998047        31145       512.00
   20348.927     0.998242        31152       568.89
   20381.695     0.998437        31157       640.00
   20447.231     0.998633        31165       731.43
   20463.615     0.998828        31169       853.33
   20529.151     0.999023        31175      1024.00
   20627.455     0.999121        31178      1137.78
   20774.911     0.999219        31181      1280.00
   20905.983     0.999316        31184      1462.86
   20938.751     0.999414        31188      1706.67
   21004.287     0.999512        31191      2048.00
   21069.823     0.999561        31192      2275.56
   21086.207     0.999609        31193      2560.00
   21250.047     0.999658        31195      2925.71
   21315.583     0.999707        31196      3413.33
   21446.655     0.999756        31198      4096.00
   21528.575     0.999780        31200      4551.11
   21528.575     0.999805        31200      5120.00
   21528.575     0.999829        31200      5851.43
   21626.879     0.999854        31201      6826.67
   21659.647     0.999878        31202      8192.00
   21659.647     0.999890        31202      9102.22
   21659.647     0.999902        31202     10240.00
   21692.415     0.999915        31204     11702.86
   21692.415     0.999927        31204     13653.33
   21692.415     0.999939        31204     16384.00
   21692.415     0.999945        31204     18204.44
   21692.415     0.999951        31204     20480.00
   21692.415     0.999957        31204     23405.71
   21692.415     0.999963        31204     27306.67
   21757.951     0.999969        31205     32768.00
   21757.951     1.000000        31205          inf
#[Mean    =    12193.689, StdDeviation   =     3635.059]
#[Max     =    21741.568, Total count    =        31205]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  45868 requests in 30.08s, 18.98MB read
Requests/sec:   1524.95
Transfer/sec:    646.28KB