sample/k8s/multibench-oneparams/k8s-hr-wrk-mixed-c6525-25g-exp12-havail0-hori1-verti1-infi1-t4-c512-d30-R500
No argument supplied nginx
using  args: threads=4 and connections=512 and duration=30 and requests=500
Running 30s test @ http://localhost:5000
  4 threads and 512 connections
  Thread calibration: mean lat.: 4.154ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 4.294ms, rate sampling interval: 14ms
  Thread calibration: mean lat.: 4.458ms, rate sampling interval: 15ms
  Thread calibration: mean lat.: 4.292ms, rate sampling interval: 14ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     4.27ms    2.30ms  11.84ms   76.05%
    Req/Sec   128.49     96.29   384.00     68.40%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.62ms
 75.000%    5.49ms
 90.000%    7.43ms
 99.000%   11.84ms
 99.900%   15.90ms
 99.990%   20.59ms
 99.999%   20.69ms
100.000%   20.69ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       1.284     0.000000            1         1.00
       2.030     0.100000          992         1.11
       2.389     0.200000         1981         1.25
       2.693     0.300000         2976         1.43
       3.047     0.400000         3962         1.67
       3.617     0.500000         4950         2.00
       3.913     0.550000         5444         2.22
       4.271     0.600000         5942         2.50
       4.643     0.650000         6434         2.86
       4.999     0.700000         6934         3.33
       5.495     0.750000         7429         4.00
       5.747     0.775000         7673         4.44
       5.959     0.800000         7920         5.00
       6.271     0.825000         8170         5.71
       6.615     0.850000         8416         6.67
       6.943     0.875000         8661         8.00
       7.163     0.887500         8787         8.89
       7.431     0.900000         8911        10.00
       7.679     0.912500         9033        11.43
       7.963     0.925000         9157        13.33
       8.303     0.937500         9280        16.00
       8.575     0.943750         9344        17.78
       8.807     0.950000         9405        20.00
       8.999     0.956250         9466        22.86
       9.303     0.962500         9528        26.67
       9.671     0.968750         9589        32.00
       9.863     0.971875         9620        35.56
      10.103     0.975000         9651        40.00
      10.375     0.978125         9682        45.71
      10.655     0.981250         9714        53.33
      10.991     0.984375         9744        64.00
      11.143     0.985938         9759        71.11
      11.471     0.987500         9775        80.00
      11.663     0.989062         9790        91.43
      11.967     0.990625         9806       106.67
      12.207     0.992188         9821       128.00
      12.431     0.992969         9829       142.22
      12.679     0.993750         9837       160.00
      12.911     0.994531         9844       182.86
      13.127     0.995313         9852       213.33
      13.455     0.996094         9860       256.00
      13.503     0.996484         9864       284.44
      13.895     0.996875         9868       320.00
      14.255     0.997266         9871       365.71
      14.511     0.997656         9875       426.67
      14.823     0.998047         9879       512.00
      15.047     0.998242         9881       568.89
      15.327     0.998437         9884       640.00
      15.375     0.998633         9885       731.43
      15.639     0.998828         9887       853.33
      15.983     0.999023         9889      1024.00
      16.031     0.999121         9890      1137.78
      16.303     0.999219         9891      1280.00
      16.719     0.999316         9892      1462.86
      17.071     0.999414         9893      1706.67
      17.423     0.999512         9894      2048.00
      17.423     0.999561         9894      2275.56
      17.791     0.999609         9895      2560.00
      17.791     0.999658         9895      2925.71
      19.119     0.999707         9896      3413.33
      19.119     0.999756         9896      4096.00
      19.119     0.999780         9896      4551.11
      20.591     0.999805         9897      5120.00
      20.591     0.999829         9897      5851.43
      20.591     0.999854         9897      6826.67
      20.591     0.999878         9897      8192.00
      20.591     0.999890         9897      9102.22
      20.687     0.999902         9898     10240.00
      20.687     1.000000         9898          inf
#[Mean    =        4.274, StdDeviation   =        2.302]
#[Max     =       20.672, Total count    =         9898]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  14814 requests in 30.01s, 6.14MB read
  Socket errors: connect 0, read 0, write 0, timeout 1015
Requests/sec:    493.69
Transfer/sec:    209.60KB